Revit 2024 API
IFCFile.Read Method (IFCFileReadOptions, Int32, Int32)
 Reads content from a file of IFC format.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public void Read(
	IFCFileReadOptions readOptions,
	out int pNumErrors,
	out int pNumWarnings
)
Visual Basic
Public Sub Read ( _
	readOptions As IFCFileReadOptions, _
	<OutAttribute> ByRef pNumErrors As Integer, _
	<OutAttribute> ByRef pNumWarnings As Integer _
)
Visual C++
public:
void Read(
	IFCFileReadOptions^ readOptions,
	[OutAttribute] int% pNumErrors,
	[OutAttribute] int% pNumWarnings
)
Parameters
readOptions
Type: Autodesk.Revit.DB.IFC.IFCFileReadOptions
 The IFC file read options.
pNumErrors
Type: System.Int32
 The number of errors reported during the read process. The actual messages will be in the log file.
pNumWarnings
Type: System.Int32
 The number of warnings reported during the read process. The actual messages will be in the log file.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  Error reading opening model for unzipping. Error reading IFC file.
See Also
IFCFile Class
Read Overload
Autodesk.Revit.DB.IFC Namespace